Repository: ministryofjustice/manchester_traffic_offences_pleas
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Is there something you would like the court to consider?
cy: Oes rhywbeth yr hoffech i'r llys ei ystyried?

source: Not guilty because?
cy: Dieuog oherwydd?

source: Why do you believe you are not guilty?
cy: Pam ydych chi'n credu eich bod yn ddieuog?

source: Do you need an interpreter in court?
cy: Oes arnoch angen cyfieithydd/dehonglydd yn y llys?

source: If yes, tell us which language (include sign language):
cy: Os oes, dywedwch wrthym pa iaith (gan gynnwys iaith arwyddion):

source: Do you disagree with any evidence from a witness statement in the notice we sent to you?
cy: Ydych chi'n anghytuno gydag unrhyw dystiolaeth mewn datganiad tyst yn yr hysbysiad a anfonwyd atoch

source: If yes, tell us the name of the witness (on the top left of the statement) and what you disagree with:
cy: Os hoffech, dywedwch wrthym beth yw enw'r tyst (ar frig y datganiad ar yr ochr chwith) a beth ydych chi'n anghytuno yn ei gylch:

source: Do you want to call a defence witness?
cy: Hoffech chi alw ar dyst yr amddiffyniad?

source: Someone who can give evidence in court supporting your case.
cy: Rhywun sy'n gallu rhoi tystiolaeth yn y llys i gefnogi eich achos.

source: If yes, tell us the name, address and date of birth of any witnesses you want to call to support your case:
cy: Os hoffech, dywedwch wrthym beth yw enw, cyfeiriad a dyddiad geni unrhyw dystion yr hoffech alw arnynt i gefnogi eich achos:

source: Does your witness need an interpreter in court?
cy: A oes angen cyfieithydd/dehonglydd yn y llys ar gyfer eich tyst?

source: Do you want to come to court to plead guilty?
cy: Hoffech chi ddod i'r llys i bledio'n euog?

source: Unique reference number (URN)
cy: Cyfeirnod unigryw (URN)

source: On page 1, usually at the top.
cy: Ar dudalen 1, fel arfer ar y brig.

source: Your session has timed out
cy: Mae eich sesiwn wedi dod i ben

source: There seems to have been a problem submitting your plea. Please try again.
cy: Mae’n ymddangos bod problem wrth gyflwyno eich ple. Rhowch gynnig arall arni.

source: About your income
cy: Ynghylch eich incwm

source: For this type of offence you'll usually have to pay a fine:
cy: Fel arfer, bydd rhaid ichi dalu dirwy am y math hwn o drosedd:

source: you must provide your income details
cy: rhaid i chi ddarparu manylion eich incwm

source: the court will decide your fine based on your finances and the seriousness of the offence
cy: bydd y llys yn penderfynu faint fydd eich dirwy ar sail eich sefyllfa ariannol a pha mor ddifrifol yw’r drosedd

source: your details will be stored securely by the court
cy: bydd y llys yn cadw eich manylion yn ddiogel

source: You've selected 'other' as your employment status
cy: Rydych chi wedi dewis 'arall' fel eich statws cyflogaeth

source: How much is your weekly take home income (after tax)?
cy: Faint yw eich incwm clir wythnosol (ar ôl treth)?

source: How much is your fortnightly take home income (after tax)?
cy: Faint yw eich incwm clir pob pythefnos (ar ôl treth)?

source: How much is your monthly take home income (after tax)?
cy: Faint yw eich incwm clir misol (ar ôl treth)?

source: How much is your average weekly take home income (after tax)?
cy: Faint yw eich incwm clir wythnosol (ar ôl treth) ar gyfartaledd?

source: Add %(name)s
cy: Ychwanegu %(name)s

source: Home
cy: Hafan

source: Your case continued
cy: Eich achos - parhad

source: Case details
cy: Manylion yr achos

source: The location of the URN and Posting date on the notice we sent to you
cy: Lleoliad y cyfeirnod unigryw a'r dyddiad postio ar yr hysbysiad a anfonwyd atoch

source: Your details
cy: Eich manylion

source: The details you've entered have already been used to make a plea online
cy: Mae’r manylion a ddarparwyd gennych wedi cael eu defnyddio i gofnodi ple ar-lein yn barod

source: Check and try again.
cy: Gwiriwch a rhowch gynnig arall arni.

source: To make changes to a plea you’ve already made online, email or write to the court before your hearing with:
cy: I newid manylion ple yr ydych wedi'i gofnodi ar-lein eisoes, anfonwch e-bost neu lythyr i'r llys cyn dyddiad eich gwrandawiad sy’n nodi’r canlynol:

source: details of the changes you want to make
cy: Manylion unrhyw newidiadau yr hoffech eu gwneud

source: your unique reference number
cy: Eich cyfeirnod unigryw

source: Hide court contact details
cy: Cuddio manylion cysylltu y llys

source: View court contact details
cy: Gweld manylion cysylltu y llys

source: Send letters to:
cy: Anfonwch lythyrau i:

source: Send email to:
cy: Anfon neges e-bost at:

source: We need these in case we have to contact you about your plea.
cy: Mae arnom angen y rhain rhag ofn y bydd angen i ni gysylltu â chi ynglŷn â’ch ple.

source: Warning:
cy: Rhybudd:

source: You can only make a plea on behalf of a company if you are a director, the company secretary or the company's solicitor.
cy: Ni chewch gofnodi ple ar ran cwmni oni bai eich bod yn gyfarwyddwr, ysgrifennydd neu'n gyfreithiwr y cwmni.

source: Company details
cy: Manylion y cwmni

source: Company details continued
cy: Manylion y cwmni - parhad

source: The court will decide the company's fine based on its size and financial situation.
cy: Bydd y llys y penderfynu ar ddirwy'r cwmni ar sail ei faint a'i sefyllfa ariannol.

source: From the most recent audited company accounts, tell us:
cy: Ar sail cyfrifon diweddaraf y cwmni sydd wedi cael eu harchwilio, dywedwch wrthym:

source: From the first 12 months' trading projections, tell us:
cy: Ar sail yr amcanestyniadau o'r 12 mis cyntaf o fasnachu, dywedwch wrthym:

source: Your plea has been sent to the court
cy: Mae eich ple wedi cael ei anfon i'r llys

source: Your company's plea has been sent to the court
cy: Mae ple eich cwmni wedi cael ei anfon i'r llys

source: Your URN:
cy: Eich cyfeirnod unigryw:

source: You will need to quote this if you contact the court
cy: Bydd arnoch angen dyfynnu hwn os byddwch yn cysylltu â'r llys

source: What happens next:
cy: Beth fydd yn digwydd nesaf:

source: we'll send you a letter with the court's decision within 3 working days after your hearing date
cy: byddwn yn anfon llythyr atoch yn dweud beth yw penderfyniad y llys cyn pen 3 diwrnod gwaith ar ôl dyddiad eich gwrandawiad

source: we'll tell you if you need to attend a trial and what evidence you may need to send to the court to support your case
cy: byddwn yn dweud wrthych os bydd angen i chi fod yn bresennol mewn treial, a pha dystiolaeth y mae’n bosib y bydd angen i chi ei hanfon i'r llys i gefnogi eich achos.

source: we'll send you a letter with a new hearing date for you to come to court for a trial
cy: byddwn yn anfon llythyr atoch yn rhoi dyddiad gwrandawiad newydd i chi ddod i'r llys ar gyfer treial

source: we'll send a letter with the court's decision within 3 working days after the hearing date
cy: byddwn yn anfon llythyr yn dweud beth yw penderfyniad y llys cyn pen 3 diwrnod gwaith ar ôl dyddiad y gwrandawiad

source: we'll tell you if a company representative needs to attend a trial and what evidence you may need to send to the court to support the case
cy: byddwn yn dweud wrthych os bydd angen i gynrychiolydd o'r cwmni fod yn bresennol mewn treial, a pha dystiolaeth y mae’n bosib y bydd angen i chi ei hanfon i'r llys i gefnogi'r achos.

source: we'll send you a letter with a new hearing date for a company representative to come to court
cy: byddwn yn anfon llythyr atoch yn rhoi dyddiad gwrandawiad newydd i gynrychiolydd o'r cwmni ddod i'r llys

source: you can <a href="javascript:window.print();">print a copy</a> of this plea confirmation for your records
cy: gallwch <a href="javascript:window.print();">argraffu copi</a> o'r cadarnhad hwn o'ch ple ar gyfer eich cofnodion

source: Do not:
cy: Peidiwch â gwneud y canlynol:

source: come to court on the hearing date shown on page 1 of the requisition notice we sent to you
cy: dod i'r llys ar y dyddiad gwrandawiad a ddangosir ar dudalen 1 yr hysbysiad gwysio a anfonwyd atoch

source: send your driving licence to the court, the DVLA will contact you if they need you to send it to them
cy: anfon eich trwydded yrru i'r llys. Bydd y DVLA yn cysylltu â chi os oes angen i chi ei hanfon atynt

source: Need to change a plea?
cy: Angen newid ple?

source: Contact the court by post or email quoting your URN before %(contact_deadline)s.
cy: Cysylltwch â'r llys drwy anfon llythyr neu e-bost gan ddyfynnu eich cyfeirnod unigryw cyn %(contact_deadline)s.

source: The contact details for the court are:
cy: Y manylion cyswllt ar gyfer eich llys yw:

source: By post:
cy: Drwy’r post:

source: By email:
cy: Drwy e-bost:

source: Finish
cy: Gorffen

source: Your plea has been sent to the magistrate
cy: Mae eich ple wedi cael ei anfon at yr ynad

source: Your company's plea has been sent to the magistrate
cy: Mae ple eich cwmni wedi cael ei anfon at yr ynad

source: we'll send you a letter with the magistrate's decision
cy: byddwn yn anfon llythyr atoch yn dweud beth yw penderfyniad yr ynad

source: we'll send you a letter with a hearing date for you to come to court for a trial
cy: byddwn yn anfon llythyr atoch yn rhoi dyddiad gwrandawiad i chi ddod i'r llys ar gyfer treial

source: we'll send a letter with the magistrate's decision
cy: byddwn yn anfon llythyr atoch yn dweud beth yw penderfyniad yr ynad

source: we'll send you a letter with a hearing date for a company representative to attend a trial
cy: byddwn yn anfon llythyr atoch yn rhoi dyddiad gwrandawiad i gynrychiolydd o'r cwmni ddod i'r treial

source: Do not send your driving licence to the court. The DVLA will contact you if they need you to send it to them.
cy: Peidiwch ag anfon eich trwydded yrru i'r llys. Bydd y DVLA yn cysylltu â chi os oes angen i chi ei hanfon atynt.

source: Your court
cy: Eich llys

source: You can contact the court by post or email quoting your URN before the date of your hearing.
cy: Gallwch gysylltu â’r llys drwy anfon llythyr neu e-bost gan ddyfynnu eich cyfeirnod unigryw cyn dyddiad eich gwrandawiad.

source: We can't find your court
cy: Ni allwn ddod o hyd i'ch llys

source: You'll find contact details for the court considering your case in the notice we sent you.
cy: Fe ddewch o hyd i fanylion cysylltu ar gyfer y llys sy'n ystyried eich achos yn yr hysbysiad a anfonwyd atoch.

source: We don’t recognise the URN you’ve entered
cy: Nid ydym yn adnabod y cyfeirnod unigryw rydych wedi'i roi

source: The unique reference number you entered doesn’t match our records.
cy: Nid yw'r cyfeirnod unigryw rydych wedi'i roi yn cyfateb i'n cofnodion.

source: Check your URN (it’s on page 1 of the notice we sent you, usually at the top) then try again.
cy: Gwiriwch eich cyfeirnod unigryw (mae ar dudalen 1 yr hysbysiad a anfonwyd atoch, fel arfer ar y brig) a rhowch gynnig arall arni.

source: You need to fix the errors on this page before continuing.
cy: Mae arnoch angen cywiro’r gwallau ar y dudalen hon cyn mynd ymlaen.

source: Enter your URN to find the contact details for your court.
cy: Rhowch eich cyfeirnod unigryw i ddod o hyd i'r manylion cysylltu ar gyfer eich llys.

source: Questions about your case
cy: Cwestiynau ynglŷn â'ch achos

source: If you have questions about your case and want to contact the court considering your case, enter your unique reference number (URN).
cy: Os oes gennych gwestiynau ynglŷn â'ch achos, ac eisiau cysylltu â'r llys sy'n ystyried eich achos, rhowch eich cyfeirnod unigryw (URN).

source: Find my court
cy: Dod o hyd i fy llys

source: Company representative details
cy: Manylion cynrychiolydd y cwmni

source: Company's plea
cy: Ple'r cwmni

source: Your finances
cy: Eich cyllid

source: Your expenses
cy: Eich treuliau

source: Company financial details
cy: Manylion ariannol y cwmni

source: you can print a copy of this plea confirmation for your records
cy: gallwch argraffu copi o'r cadarnhad hwn o'ch ple ar gyfer eich cofnodion

source: Email %(court)s quoting your URN.
cy: Anfonwch neges e-bost i %(court)s gan ddyfynnu eich cyfeirnod unigryw.

source: Your email must arrive before %(date)s.
cy: Rhaid i'ch neges e-bost gyrraedd cyn %(date)s.

source: Email:
cy: E-bost:

source: We're constantly working to improve this service.
cy: Rydym yn gweithio'n barhaus i wella'r gwasanaeth hwn.

source: Please give us <a href="/feedback/">feedback</a> so we can make it better.
cy: Rhowch <a href="/feedback/">adborth</a> i ni fel y gallwn ei wella.

source: GOV.UK - Online plea submission confirmation
cy: GOV.UK - Cadarnhad o gofnodi ple ar-lein

source: Please give us feedback so we can make it better:
cy: Gofynnwn yn garedig ichi roi adborth inni fel y gallwn ei wella:

source: If you're unsure an email is from the Ministry of Justice:
cy: Os nad ydych yn siŵr fod neges e-bost wedi cael ei hanfon gan y Weinyddiaeth Cyfiawnder:

source: do not reply to it or click any links
cy: peidiwch ag ateb y neges na chlicio ar unrhyw ddolenni

source: forward it to
cy: anfonwch y neges ymlaen i

source: Terms and Conditions and Privacy Policy:
cy: Telerau ac Amodau a Pholisi Preifatrwydd:

source: Your online plea has been submitted
cy: Mae eich ple ar-lein wedi cael ei gyflwyno

source: Information for the magistrate
cy: Gwybodaeth i'r ynadon

source: To help the court make a decision about your payment terms, you must provide information about your expenses.
cy: I helpu’r llys wneud penderfyniad ynglŷn â'ch telerau talu, mae’n rhaid i chi roi gwybodaeth am eich treuliau.

source: Household expenses
cy: Treuliau’r cartref

source: What are your monthly household bills for the following?
cy: Beth yw biliau misol eich cartref ar gyfer y canlynol?

source: Your notice
cy: Eich hysbysiad

source: The location of the words 'Single Justice Procedure Notice', if present, at the top of the notice we sent to you
cy: Mae'r geiriau 'Hysbysiad Gweithdrefn Un Ynad' i'w gweld ar frig yr hysbysiad a anfonwyd atoch, os ydynt yno

source: From page 1 of the notice we sent to you:
cy: O dudalen 1 yr hysbysiad a anfonwyd atoch:

source: Other expenses
cy: Treuliau Eraill

source: What are your monthly bills for the following?
cy: Beth yw eich biliau misol ar gyfer y canlynol?

source: Company plea
cy: Ple'r cwmni

source: Your plea continued
cy: Eich ple - parhad

source: Company plea continued
cy: Ple'r cwmni - parhad

source: Unique reference number
cy: Cyfeirnod unigryw

source: Change <span>Unique Reference Number</span>
cy: Newid <span>Cyfeirnod Unigryw</span>

source: Change <span>number of charges and postcode</span>
cy: Newid <span>nifer y cyhuddiadau a chod post</span>

source: You are
cy: Chi yw

source: Person named on the notice
cy: Yr unigolyn sydd wedi'i enwi ar yr hysbysiad

source: Change <span>case details</span>
cy: Newid<span>manylion yr achos</span>

source: Trading for more than 12 months
cy: Masnachu am fwy na 12 mis

source: Yes,No (v1)
cy: Ydy,Nac ydy

source: From the most recent audited company accounts
cy: Ar sail cyfrifon diweddaraf y cwmni sydd wedi cael eu harchwilio

source: From the first 12 months' trading projections
cy: Ar sail yr amcanestyniadau o'r 12 mis cyntaf o fasnachu

source: Address
cy: Cyfeiriad

source: As printed on the notice
cy: Fel y mae wedi'i argraffu ar yr hysbysiad

source: National Insurance number
cy: Rhif yswiriant gwladol

source: UK driving licence number
cy: Rhif trwydded yrru y DU

source: Company address
cy: Cyfeiriad y cwmni

source: Position held
cy: Eich swydd

source: Change <span>magistrate information</span>
cy: Newid <span>gwybodaeth ynadon</span>

source: Paying a fine would cause me financial problems because
cy: Byddai talu dirwy yn achosi problemau ariannol difrifol i mi oherwydd

source: Change <span>your household expenses</span>
cy: Newid <span>eich treuliau cartref</span>

source: Other contributors to household bills
cy: Eraill sy’n cyfrannu at filiau’r cartref

source: Yes,No (v3)
cy: Oes,Nac oes

source: Total household expenses
cy: Cyfanswm treuliau’r cartref

source: Change <span>your other expenses</span>
cy: Newid <span>eich treuliau eraill</span>

source: Other expenses (not listed)
cy: Treuliau eraill (nad ydynt wedi'u rhestru)

source: Total other expenses
cy: Cyfanswm treuliau eraill

source: Your employment status
cy: Eich statws cyflogaeth

source: Change <span>your employment status</span>
cy: Newid <span>eich statws cyflogaeth</span>

source: Your employment
cy: Eich cyflogaeth

source: Change <span>your employment</span>
cy: Newid <span>eich cyflogaeth</span>

source: You get paid
cy: Rydych yn cael eich talu

source: Amount
cy: Swm

source: Your self-employment
cy: Eich hunangyflogaeth

source: Change <span>your self-employment</span>
cy: Newid <span>eich hunangyflogaeth</span>

source: Your out of work benefits
cy: Eich budd-daliadau diweithdra

source: Change <span>your out of work benefits</span>
cy: Newid <span>eich budd-daliadau diweithdra</span>

source: You receive
cy: Rydych yn derbyn

source: Your benefit is paid
cy: Telir eich budd-dal

source: Your income
cy: Eich incwm

source: Change <span>your income</span>
cy: Newid <span>eich incwm</span>

source: Source
cy: Ffynhonnell

source: Your benefits
cy: Eich budd-daliadau

source: Change <span>your benefits</span>
cy: Newid <span>eich budd-daliadau</span>

source: Your benefits are paid
cy: Telir eich budd-daliadau

source: Your Pension Credit
cy: Eich Credyd Pensiwn

source: Change <span>your Pension Credit</span>
cy: Newid <span>eich Credyd Pensiwn</span>

source: Paid
cy: Rydych yn cael eich talu yn

source: Total weekly income
cy: Cyfanswm incwm wythnosol

source: Financial hardship
cy: Caledi ariannol

source: Charge
cy: Cyhuddiad

source: Change <span>your plea for charge %(charge_number)s</span>
cy: Newid<span>eich ple ar gyfer y cyhuddiad%(charge_number)s</span>

source: Plead guilty in court
cy: Pledio'n euog yn y llys

source: Interpreter required
cy: Mae angen cyfieithydd

source: Language
cy: Iaith

source: Not guilty because
cy: Dieuog oherwydd

source: Disagree with any evidence from a witness statement?
cy: Ydych chi'n anghytuno gydag unrhyw dystiolaeth mewn datganiad tyst?

source: Name of the witness and what you disagree with
cy: Enw'r tyst a'r hyn rydych chi'n anghytuno yn ei gylch

source: Wants to call a witness?
cy: Eisiau galw ar dyst?

source: Name, date of birth and address of the witness
cy: Enw, dyddiad geni a chyfeiriad y tyst

source: This is your opportunity to present your case to the court:
cy: Dyma eich cyfle chi i gyflwyno eich achos i’r llys.

source: the charge details and witness statements are in the requisition pack we sent to you
cy: Mae manylion y cyhuddiad a datganiadau'r tystion yn y pecyn gwysio a anfonwyd atoch

source: each offence may carry penalty points and a fine
cy: mae'n bosib y gellir rhoi pwyntiau cosb a dirwy am bob un o'r troseddau

source: if you plead guilty you may get a 33%% discount on any fine
cy: os byddwch yn pledio'n euog, mae'n bosib y cewch ddisgownt o 33%% oddi ar unrhyw ddirwy

source: This is your opportunity to present the company's case to the court:
cy: Dyma eich cyfle chi i gyflwyno achos y cwmni i'r llys.

source: each offence may result in a fine
cy: gall pob un o'r troseddau arwain at ddirwy

source: if you plead guilty on its behalf, the company may get a 33%% discount on any fine
cy: os byddwch yn pledio'n euog ar ei ran, mae'n bosib y caiff y cwmni ddisgownt o 33%% oddi ar unrhyw ddirwy

source: Charge %(charge_number)s of %(total)s
cy: Cyhuddiad %(charge_number)s o %(total)s

source: Charge %(charge_number)s of %(total)s continued
cy: Cyhuddiad %(charge_number)s o %(total)s - parhad

source: Pleading guilty to this charge means you do not need to come to court to respond to this charge - we'll send you details of the court's decision and what to do next.
cy: Mae pledio'n euog i'r cyhuddiad hwn, yn golygu nad oes angen i chi ddod i'r llys i ymateb i'r cyhuddiad hwn - byddwn yn anfon manylion penderfyniad y llys a beth i'w wneud nesaf atoch

source: Pleading guilty to this charge means a company representative does not need to come to court to respond to this charge - we'll send details of the court's decision and what happens next.
cy: Mae pledio'n euog i'r cyhuddiad hwn yn golygu nad oes angen i gynrychiolydd o'r cwmni ddod i'r llys i ymateb i'r cyhuddiad hwn - byddwn yn anfon manylion penderfyniad y llys a beth sy'n digwydd nesaf.

source: However, you do have the option to plead guilty in court if you want to.
cy: Fodd bynnag, mae gennych y dewis i bledio'n euog yn y llys os ydych eisiau.

source: Pleading not guilty to this charge means we'll send details of a date for you to come to court for a trial.
cy: Os byddwch yn pledio'n ddieuog i'r cyhuddiad hwn, byddwn yn anfon manylion dyddiad i chi ddod i'r llys ar gyfer treial.

source: Pleading not guilty to this charge means you do not come to court on the hearing date in your requisition pack - we'll send details of a new hearing date.
cy: Mae pledio'n ddieuog i'r cyhuddiad hwn yn golygu na fyddwch yn dod i'r llys ar y dyddiad gwrandawiad sydd yn eich pecyn gwysio - byddwn yn anfon manylion dyddiad gwrandawiad newydd.

source: Pleading not guilty to this charge means we'll send details of a date for a company representative to come to court for a trial.
cy: Os byddwch yn pledio'n ddieuog i'r cyhuddiad hwn, byddwn yn anfon manylion dyddiad i gynrychiolydd o'r cwmni ddod i'r llys ar gyfer treial.

source: Tell us why you believe the company is not guilty:
cy: Dywedwch wrthym pam rydych yn credu bod y cwmni'n ddieuog:

source: Does your company representative need an interpreter in court?
cy: Oes angen cyfieithydd/dehonglydd yn y llys ar gyfer cynrychiolydd eich cwmni?

source: Evidence and witness information
cy: Tystiolaeth a gwybodaeth am y tyst

source: Confirm your company's plea
cy: Cadarnhewch ble eich cwmni

source: Confirm your plea
cy: Cadarnhewch eich ple

source: Review the information you’ve given before making your plea.
cy: Adolygwch yr wybodaeth rydych wedi'i rhoi cyn cofnodi eich ple.

source: Change <span>your details</span>
cy: Newid<span>eich manylion</span>

source: Your employment status and finances
cy: Eich statws cyflogaeth a'ch sefyllfa ariannol

source: Special financial circumstances
cy: Amgylchiadau ariannol arbennig

source: Change <span>details</span>
cy: Newid<span>manylion</span>

source: Important
cy: Pwysig

source: It is an offence to make a false statement or to deliberately fail to disclose any relevant facts.
cy: Mae gwneud datganiad anwir neu fethu datgelu unrhyw ffeithiau perthnasol yn fwriadol yn drosedd.

source: I confirm that I have read and understand the charge against me and that I am the person named in the Single Justice Procedure Notice.
cy: Rwy’n cadarnhau fy mod wedi darllen a deall y cyhuddiad yn fy erbyn ac mai fi yw'r unigolyn a enwir yn yr Hysbysiad Gweithdrefn Un Ynad.

source: I confirm that I have read and understand the charge against me and that I am the person named in the Postal Requisition.
cy: Rwy’n cadarnhau fy mod wedi darllen a deall y cyhuddiad yn fy erbyn ac mai fi yw'r unigolyn a enwir yn y Wŷs drwy'r Post.

source: I confirm that I have read and understand the charge and that I am a representative of the company named in the Single Justice Procedure Notice and am legally entitled to enter a plea on its behalf.
cy: Rwy’n cadarnhau fy mod wedi darllen a deall y cyhuddiad ac mai fi yw cynrychiolydd y cwmni a enwir yn yr Hysbysiad Gweithdrefn Un Ynad. Mae gennyf hawl gyfreithiol i gofnodi ple ar ei ran.
