Repository: ministryofjustice/manchester_traffic_offences_pleas
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: I confirm that I have read and understand the charge and that I am a representative of the company named in the Postal Requisition and am legally entitled to enter a plea on its behalf.
cy: Rwy’n cadarnhau fy mod wedi darllen a deall y cyhuddiad ac mai fi yw'r unigolyn sy'n cynrychioli'r cwmni a enwir yn y Wŷs drwy'r Post. Mae gennyf hawl gyfreithiol i gofnodi ple ar ei ran.

source: The facts stated here are correct to the best of my knowledge.
cy: Mae’r ffeithiau sydd wedi’u datgan yma yn gywir hyd eithaf fy ngwybodaeth.

source: Make your plea
cy: Cofnodi eich ple

source: Your case
cy: Eich achos

source: Make a plea by post
cy: Pledio drwy'r post

source: Your reference number isn’t recognised. Please complete and send the form enclosed with your notice.
cy: Nid ydym yn adnabod eich cyfeirnod. Llenwch ac anfonwch y ffurflen sy'n amgaeedig ynghyd â'ch hysbysiad.

source: URN already used
cy: Cyfeirnod unigryw wedi'i ddefnyddio eisoes

source: This URN has already been used to make a plea online
cy: Mae’r cyfeirnod unigryw hwn wedi cael ei ddefnyddio i gofnodi ple ar-lein yn barod

source: The unique reference number you entered is no longer valid. Please check and try again.
cy: Nid yw’r cyfeirnod unigryw rydych wedi’i roi yn ddilys bellach. Gwiriwch a rhowch gynnig arall arni, os gwelwch yn dda?

source: Create a new plea
cy: Creu ple newydd

source: Select the button below to start a new plea
cy: Dewiswch y botwm isod i ddechrau ple newydd

source: Start now
cy: Dechrau nawr

source: How much is your weekly benefit payment?
cy: Faint yw eich taliad budd-dal wythnosol?

source: How much is your fortnightly benefit payment?
cy: Faint yw eich taliad budd-dal pob pythefnos?

source: How much is your monthly benefit payment?
cy: Faint yw eich taliad budd-dal misol?

source: We need these in case we have to get in touch with you about your plea.
cy: Mae angen y rhain arnom rhag ofn y bydd rhaid inni gysylltu â chi ynghylch eich ple.

source: Important:
cy: Pwysig:

source: If you have a UK driving licence and fail to tell us, your licence may be suspended.
cy: Os oes gennych drwydded yrru y DU a'ch bod yn methu a dweud wrthym, mae'n bosib y caiff eich trwydded ei hatal.

source: What is your weekly take home pay (after tax)?
cy: Beth yw eich cyflog clir wythnosol (ar ôl treth)?

source: What is your fortnightly take home pay (after tax)?
cy: Beth yw eich cyflog clir pob pythefnos (ar ôl treth)?

source: What is your monthly take home pay (after tax)?
cy: Beth yw eich cyflog clir pob mis (ar ôl treth)?

source: Totals
cy: Cyfansymiau

source: Your fine will be based on what the court considers to be your weekly income, calculated from the information you've provided.
cy: Bydd eich dirwy yn seiliedig ar beth mae'r llys yn ei ystyried yw eich incwm wythnosol, wedi'i gyfrifo o'r wybodaeth a ddarparwyd gennych chi.

source: Your income sources and your total weekly income
cy: Eich ffynonellau incwm a chyfanswm eich incwm wythnosol

source: Income source
cy: Ffynhonnell Incwm

source: Frequency
cy: Amlder

source: Amount (take home)
cy: Swm (clir)

source: Employment
cy: Cyflogaeth

source: Self-employment
cy: Hunangyflogaeth

source: Benefits
cy: Budd-daliadau

source: Pension Credit
cy: Credyd Pensiwn

source: Edit
cy: Golygu

source: Note:
cy: Sylwch:

source: For the courts to consider allowing you to pay your fine in instalments, you must provide information about your expenses.
cy: Er mwyn i’r llys ystyried caniatáu i chi dalu eich dirwy mewn rhandaliadau, mae’n rhaid i chi roi gwybodaeth am eich treuliau.

source: How much is your average weekly benefit payment?
cy: Faint yw eich taliad budd-dal wythnosol ar gyfartaledd?

source: How much is your weekly Pension Credit payment?
cy: Faint yw eich taliad Credyd Pensiwn wythnosol?

source: How much is your fortnightly Pension Credit payment?
cy: Faint yw eich taliad Credyd Pensiwn pob pythefnos?

source: How much is your monthly Pension Credit payment?
cy: Faint yw eich taliad Credyd Pensiwn misol?

source: What is your average weekly take home pay (after tax)?
cy: Beth yw eich cyflog clir wythnosol (ar ôl treth) ar gyfartaledd?

source: Because you've pleaded guilty to at least 1 charge you must now tell us about your employment status.
cy: Oherwydd eich bod wedi pledio'n euog i o leiaf 1 cyhuddiad, mae'n rhaid i chi ddweud wrthym yn awr am eich statws cyflogaeth.

source: This will:
cy: Bydd hyn yn:

source: make sure your fine is based on your circumstances
cy: sicrhau bod eich dirwy yn seiliedig ar eich amgylchiadau

source: help to speed up the processing of your case
cy: helpu i gyflymu'r broses o ran hwyluso eich achos

source: Notice of fine and collection order
cy: Rhybudd o ddirwy a gorchymyn casglu

source: URN:
cy: Cyfeirnod unigryw:

source: Your court:
cy: Eich llys:

source: Fines and penalties
cy: Dirwyon a chosbau

source: Total to pay:
cy: Cyfanswm i'w dalu:

source: Pay by:
cy: Talu erbyn:

source: Endorsements:
cy: Ardystiadau:

source: What happens next
cy: Beth fydd yn digwydd nesaf

source: When paying your fine
cy: Pan fyddwch yn talu eich dirwy

source: You will need to tell us:
cy: Bydd arnoch angen dweud wrthym:

source: Division:
cy: Adran:

source: Account number:
cy: Rhif y cyfrif:

source: Payments must be received on or before the date ordered.
cy: Rhaid i'r taliad gyrraedd y llys cyn neu ar y dyddiad a nodir ar y gorchymyn.

source: If you want more information about your account contact the court.
cy: Cysylltwch â'r llys os hoffech ragor o wybodaeth am eich cyfrif.

source: Ways to pay
cy: Ffyrdd i dalu

source: Online:
cy: Ar-lein:

source: Copy and paste this web address into a new browser window.
cy: Copïwch a gludwch y cyfeiriad gwe hwn i mewn i ffenestr pori arall

source: Phone:
cy: Ffôn:

source: When you pay you will be given an authorisation number. Keep this as proof of payment along with the date and amount paid:
cy: Pan fyddwch yn talu, cewch rif awdurdodi taliad. Cadwch y rhif hwn fel prawf o'ch taliad, ynghyd â'r dyddiad a'r swm a dalwyd:

source: If you're having difficulty paying
cy: Os ydych yn cael problemau wrth dalu

source: If you cannot pay as instructed or can no longer pay as ordered due to a change in your financial circumstances, contact the Fines Team to discuss your options.
cy: Os na allwch dalu yn unol â'r cyfarwyddyd, neu os na allwch dalu fel y gorchmynnwyd oherwydd bod eich sefyllfa ariannol wedi newid, cysylltwch â'r Tîm Dirwyon i drafod eich opsiynau.

source: If you do not pay
cy: Os na fyddwch yn talu

source: If you fail to pay this fine as ordered you will be liable for further penalties. This could include:
cy: Os na fyddwch yn talu'r ddirwy hon fel y gorchmynnwyd, byddwch yn agored i gael eich cosbi ymhellach. Gall hyn gynnwys:

source: Deductions from your earnings or benefits
cy: Didyniadau o'ch enillion neu fudd-daliadau

source: 50%% increase in your fine
cy: Cynyddu eich dirwy 50%%

source: Clamping, removal and sale of your vehicle
cy: Clampio, symud neu werthu eich cerbyd

source: Registering the account in the Register of Judgments, Orders and Fines (making it harder for you to get credit)
cy: Cofrestru'r cyfrif ar y Gofrestr Dyfarniadau, Gorchmynion a Dirwyon (i'w gwneud yn anoddach i chi gael credyd)

source: Continued default - you may be sent to prison
cy: Parhau i beidio â thalu - efallai y cewch eich anfon i'r carchar

source: What should I do if I change my name or address?
cy: Beth ddylwn ei wneud os byddaf yn newid fy enw neu gyfeiriad?

source: Skip to main content
cy: Neidio i'r prif gynnwys

source: Go to the GOV.UK homepage
cy: Ewch i hafan GOV.UK

source: &copy; Crown copyright
cy: &copy; Hawlfraint y Goron

source: Welsh
cy: Cymraeg

source: Page not found
cy: Ni ddaethpwyd o hyd i'r dudalen

source: If you entered a web address please check it was correct, or you can:
cy: Os ydych wedi rhoi cyfeiriad gwefan, gwiriwch ei fod yn gywir, neu gallwch:

source: <a href="/">Start a new plea</a> or go to <a href="https://www.gov.uk/">GOV.UK</a>
cy: <a href="/">Ddechrau ple newydd</a> neu fynd i <a href="https://www.gov.uk/">GOV.UK</a>.

source: Service unavailable
cy: Nid yw'r gwasanaeth ar gael

source: We are experiencing technical difficulties
cy: Rydym yn cael problemau technegol ar hyn o bryd

source: The online plea service is not available right now, but we're working hard to get things up and running again. Try again later.
cy: Nid yw’r gwasanaeth pledio ar-lein ar gael ar hyn o bryd, ond rydym yn gwneud ein gorau glas i ddatrys y broblem. Rhowch gynnig arall yn nes ymlaen.

source: Make a Plea: Traffic offences
cy: Cofnodi ple: Troseddau traffig

source: GOV.UK uses cookies to make the site simpler.
cy: Mae GOV.UK yn defnyddio cwcis i wneud y safle'n symlach.

source: Find out more about cookies
cy: Mwy o wybodaeth am y cwcis

source: This is a new service - <a href="%(feedback_url)s">your feedback</a> will help us to improve it.
cy: Mae hwn yn wasanaeth newydd - <a href="%(feedback_url)s">bydd eich adborth</a> yn ein helpu i'w wella.

source: Session timeout
cy: Terfyn amser sesiwn

source: Your session has expired, re-enter your details and try again.
cy: Mae eich sesiwn wedi dod i ben, cyflwynwch eich manylion eto a rhowch gynnig arall arni.

source: Terms and Conditions and Privacy Policy
cy: Telerau ac Amodau a Pholisi Preifatrwydd

source: Cookies
cy: Cwcis

source: Help
cy: Cymorth

source: Contact
cy: Cysylltu

source: Built by <a href="https://mojdigital.blog.gov.uk/"><abbr title="Ministry of Justice">MOJ</abbr> Digital</a>
cy: Adeiladwyd gan<a href="https://mojdigital.blog.gov.uk/"><abbr title="Ministry of Justice">MOJ</abbr> Digital</a>

source: All content is available under the <a href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license">Open Government Licence v3.0</a>, except where otherwise stated
cy: Mae'r holl gynnwys ar gael o dan yr <a href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license"> Open Government Licence v3.0</a>, ac eithro ble y nodir yn wahanol

source: You have entered some information
cy: Rydych wedi rhoi rhywfaint o wybodaeth

source: See highlighted errors below.
cy: Gweler y gwallau wedi’u hamlygu isod.

source: Terms and Conditions and privacy policy
cy: Telerau ac Amodau a pholisi preifatrwydd

source: Start again
cy: Cychwyn eto

source: Make a plea online
cy: Cofnodi ple ar-lein

source: Use this service to plead guilty or not guilty to each offence you're charged with.
cy: Defnyddiwch y gwasanaeth hwn i bledio'n euog neu'n ddieuog i bob trosedd rydych wedi cael eich cyhuddo ohono.

source: You'll need to:
cy: Bydd angen i chi:

source: carefully read the notice, charge sheet and witness statements in the pack we sent to you
cy: ddarllen yn ofalus yr hysbysiad, y daflen gyhuddiadau a'r datganiadau tystion yn y pecyn a anfonwyd atoch

source: enter information contained in the pack, so have it with you when you start
cy: cyflwyno gwybodaeth sydd wedi'i chynnwys yn y pecyn, felly gwnewch yn siŵr fod yr wybodaeth gennych pan fyddwch yn dechrau

source: be the person, or an official representative of the company, named in the notice
cy: fod yr unigolyn, neu'n gynrychiolydd swyddogol o'r cwmni, a enwir yn yr hysbysiad

source: You may:
cy: Mae'n bosib:

source: get a 33%% discount on your fine if you plead guilty
cy: y cewch ddisgownt o 33%% oddi ar eich dirwy os byddwch yn pledio'n euog

source: be asked to enter your National Insurance and UK driving licence numbers
cy: y gofynnir i chi roi eich rhif Yswiriant Gwladol a'ch rhif Trwydded Yrru y DU

source: be asked about your income and outgoings (such as utility bills), or your company's finances, so the magistrate can work out your fine
cy: y gofynnir i chi am eich incwm a'ch gwariant (megis biliau cyfleustodau), neu gyllid eich cwmni, er mwyn i'r ynad allu cyfrifo'r ddirwy gywir

source: Support
cy: Cymorth

source: Legal help and advice
cy: Cyngor a chymorth cyfreithiol

source: Questions about your pleas?
cy: Cwestiynau am eich pledion?

source: Need help using this service?
cy: Angen help i ddefnyddio'r gwasanaeth hwn?
