Repository: ministryofjustice/manchester_traffic_offences_pleas
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: You must tell us if you used the call centre
cy: Rhaid i chi ddweud wrthym os gwnaethoch ddefnyddio'r ganolfan alwadau

source: Select an option to tell us how satisfied you were with the call centre
cy: Dewiswch opsiwn i ddweud wrthym pa mor fodlon oeddech chi gyda'r ganolfan alwadau

source: Select an option to tell us how satisfied you were with the service
cy: Dewiswch opsiwn i ddweud wrthym pa mor fodlon oeddech chi gyda'r gwasanaeth

source: very satisfied
cy: bodlon iawn

source: satisfied
cy: bodlon

source: neither satisfied nor dissatisfied
cy: ddim yn fodlon nac yn anfodlon

source: dissatisfied
cy: anfodlon

source: very dissatisfied
cy: anfodlon iawn

source: Overall, how satisfied were you with this service?
cy: Yn gyffredinol, pa mor fodlon oeddech chi gyda'r gwasanaeth hwn?

source: Overall, how satisfied were you with the call centre?
cy: Yn gyffredinol, pa mor fodlon oeddech chi gyda'r ganolfan alwadau?

source: Did you use the call centre to help you make your plea?
cy: A wnaethoch ddefnyddio'r ganolfan alwadau i'ch helpu i gofnodi eich ple?

source: If you have any further comments about this service, tell us here:
cy: Os oes gennych unrhyw sylwadau pellach am y gwasanaeth hwn, dywedwch wrthym yma:

source: Email address
cy: Cyfeiriad e-bost

source: If you'd like us to get back to you, tell us your email address below:
cy: Os hoffech inni ddod yn ôl atoch, rhowch eich cyfeiriad e-bost isod:

source: Submission Error
cy: Gwall wrth gyflwyno

source: There seems to have been a problem submitting your feedback. Please try again.
cy: Mae’n ymddangos bod problem wrth gyflwyno eich adborth. Rhowch gynnig arall arni.

source: Your feedback
cy: Eich adborth

source: Submit
cy: Cyflwyno

source: Back
cy: Yn ôl

source: Your feedback has been submitted
cy: Mae eich adborth wedi cael ei gyflwyno

source: This is your opportunity to tell us your views about using this online plea service.
cy: Dyma eich cyfle chi i ddweud eich dweud ynglŷn â defnyddio'r gwasanaeth pledio ar-lein.

source: If you have questions about your case, you'll need to contact your court using our <a href="%(court_finder_url)s">court finder service</a>.
cy: Os oes gennych unrhyw gwestiynau mewn perthynas â'ch achos, bydd arnoch angen cysylltu â'ch llys drwy ddefnyddio ein <a href="%(court_finder_url)s">gwasanaeth dod o hyd i lys</a>.

source: Continue
cy: Parhau

source: Day
cy: Diwrnod

source: Month
cy: Mis

source: Year
cy: Blwyddyn

source: Yes (v1)
cy: Ydy

source: No (v1)
cy: Nac ydy

source: Yes (v2)
cy: Ydw

source: No (v2)
cy: Nac ydw

source: Yes (v3)
cy: Oes

source: No (v3)
cy: Nac oes

source: Yes (v4)
cy: Byddai

source: No (v4)
cy: Na fyddai

source: Yes (v5)
cy: Do

source: No (v5)
cy: Naddo

source: Yes (v6)
cy: Hoffwn

source: No (v6)
cy: Na hoffwn

source: (optional)
cy: (dewisol)

source: Charge %(counter)s
cy: Cyhuddiad %(counter)s

source: Your plea for charge %(counter)s
cy: Eich ple ar gyfer cyhuddiad %(counter)s

source: Plea for charge %(counter)s
cy: Ple ar gyfer cyhuddiad %(counter)s

source: Hide charge information
cy: Cuddio gwybodaeth am y cyhuddiad

source: View charge information
cy: Gweld gwybodaeth am y cyhuddiad

source: Your plea
cy: Eich ple

source: Guilty
cy: Euog

source: Not guilty
cy: Dieuog

source: Change your plea for this charge
cy: Newid eich ple ar gyfer y cyhuddiad hwn

source: Region
cy: Rhanbarth

source: Match
cy: Tebyg

source: Online plea submission confirmation
cy: Cadarnhad o gofnodi ple ar-lein

source: Tell us what is written at the top of the notice we sent to you
cy: Dywedwch wrthym beth sydd wedi'i ysgrifennu ar frig yr hysbysiad a anfonwyd atoch

source: Enter your Unique Reference Number (URN)
cy: Rhowch eich cyfeirnod unigryw (URN)

source: The Unique Reference Number (URN) isn't valid. Enter the number exactly as it appears on page 1 of the notice
cy: Nid yw’r cyfeirnod unigryw (URN) yn ddilys. Rhowch y rhif yn union fel y mae’n ymddangos ar dudalen 1 o’r hysbysiad

source: Enter the correct URN
cy: Rhowch yr URN cywir

source: You've entered incorrect details
cy: Rydych wedi rhoi manylion anghywir

source: Provide a court hearing date
cy: Rhowch ddyddiad gwrandawiad llys

source: The court hearing date isn't a valid format
cy: Nid yw dyddiad y gwrandawiad llys mewn fformat dilys

source: The court hearing date must be after today
cy: Rhaid i ddyddiad y gwrandawiad llys fod ar ôl dyddiad heddiw

source: Enter the correct hearing date
cy: Rhowch y dyddiad cywir ar gyfer y gwrandawiad llys

source: Provide a posting date
cy: Rhowch ddyddiad postio

source: The posting date isn't a valid format
cy: Nid yw'r dyddiad postio mewn fformat dilys

source: The posting date must be before today
cy: Rhaid i'r dyddiad postio fod cyn heddiw

source: Enter the correct posting date
cy: Rhowch y dyddiad postio cywir

source: Enter the number of charges against you
cy: Rhowch y nifer o gyhuddiadau sydd yn eich erbyn

source: You must tell us if you are the person named in the notice or pleading on behalf of a company
cy: Rhaid i chi ddweud wrthym ai chi yw'r unigolyn a enwir yn yr hysbysiad neu unigolyn sy'n pledio ar ran cwmni

source: Enter your first name
cy: Rhowch eich enw cyntaf

source: Enter your last name
cy: Rhowch eich cyfenw

source: You must tell us if the address on the notice we sent to you is correct
cy: Rhaid i chi ddweud wrthym a yw'r cyfeiriad ar yr hysbysiad a anfonwyd atoch yn gywir

source: Enter your correct address
cy: Rhowch eich cyfeiriad cywir

source: Tell us if the company's address, as it's written on the notice, is correct
cy: Dywedwch wrthym a yw cyfeiriad y cwmni, fel y mae wedi'i ysgrifennu ar yr hysbysiad, yn gywir

source: Enter the correct company address
cy: Rhowch gyfeiriad cywir y cwmni

source: You must provide an email address
cy: Rhaid i chi ddarparu cyfeiriad e-bost

source: Email address isn't a valid format
cy: Nid yw’r cyfeiriad e-bost mewn fformat dilys

source: You must provide a contact number
cy: Rhaid i chi ddarparu rhif cyswllt

source: The contact number isn't a valid format
cy: Nid yw’r rhif cyswllt mewn fformat dilys

source: Tell us your date of birth
cy: Dywedwch wrthym beth yw eich dyddiad geni

source: The date of birth isn't a valid format
cy: Nid yw'r dyddiad geni mewn fformat dilys

source: The date of birth must be before today
cy: Rhaid i'r dyddiad geni fod cyn heddiw

source: Tell us if you have a National Insurance number
cy: Dywedwch wrthym os oes gennych rif Yswiriant Gwladol

source: Tell us your National Insurance number
cy: Dywedwch wrthym beth yw eich rhif Yswiriant Gwladol

source: Tell us if you have a UK driving licence
cy: Dywedwch wrthym os oes gennych drwydded yrru y DU

source: Tell us your driving licence number
cy: Dywedwch wrthym beth yw rhif eich Trwydded Yrru

source: Enter the company name
cy: Rhowch enw'r cwmni

source: You must tell us your position in the company
cy: Rhaid i chi ddweud wrthym beth yw eich swydd yn y cwmni

source: Enter a contact number
cy: Rhowch rif cyswllt

source: You must select a plea for this charge
cy: Rhaid i chi ddewis ple ar gyfer y cyhuddiad hwn

source: You must tell us if you want to come to court to plead guilty
cy: Rhaid i chi ddweud wrthym os hoffech ddod i'r llys i bledio'n euog

source: Tell us why you believe you are not guilty
cy: Dywedwch wrthym pam rydych yn credu eich bod yn ddieuog

source: You must tell us if you need an interpreter in court
cy: Rhaid i chi ddweud wrthym os oes arnoch angen cyfieithydd/dehonglydd yn y llys

source: You must tell us which language
cy: Rhaid i chi ddweud wrthym pa iaith

source: Tell us if you disagree with any of the evidence we sent to you
cy: Dywedwch wrthym os ydych yn anghytuno gydag unrhyw dystiolaeth a anfonwyd atoch

source: You need to tell us the name of the witness and what you disagree with
cy: Rhaid i chi ddweud wrthym beth yw enw'r tyst a'r hyn rydych chi'n anghytuno yn ei gylch

source: You must tell us if you want to call a defence witness
cy: Rhaid i chi ddweud wrthym os hoffech alw ar dyst yr amddiffyniad

source: Tell us the name, address and date of birth of your defence witness
cy: Dywedwch wrthym beth yw enw, cyfeiriad a dyddiad geni tyst yr amddiffyniad

source: Tell us if your witness needs an interpreter in court
cy: Dywedwch wrthym os oes angen cyfieithydd/dehonglydd yn y llys ar gyfer eich tyst

source: Your witness needs an interpreter in court - tell us which language
cy: Mae angen cyfieithydd/dehonglydd yn y llys ar gyfer eich tyst - dywedwch wrthym pa iaith

source: Select your employment status
cy: Dewiswch eich statws cyflogaeth

source: Tell us how often you get paid
cy: Dywedwch wrthym pa mor aml rydych yn cael eich talu

source: Enter your take home pay
cy: Rhowch eich cyflog clir (cyflog ar ôl didyniadau)

source: Select the out of work benefit you receive
cy: Dewiswch y budd-daliadau diweithdra rydych yn eu cael

source: Select how often your benefit is paid
cy: Dewiswch pa mor aml y telir eich budd-dal i chi

source: Enter the amount of your benefit payment
cy: Rhowch swm eich taliad budd-daliadau

source: Tell us the source of your main income
cy: Dywedwch wrthym beth yw ffynhonnell eich prif incwm

source: Select how often your main income is paid
cy: Dewiswch pa mor aml y telir eich prif incwm i chi

source: Enter your take home income
cy: Rhowch eich incwm clir

source: Select which benefit you receive
cy: Dewiswch pa fudd-dal rydych chi'n ei gael

source: Tell us if you receive Pension Credit
cy: Dywedwch wrthym os ydych yn cael Credyd Pensiwn

source: Select how often your Pension Credit is paid
cy: Dewiswch pa mor aml y telir eich Credyd Pensiwn i chi

source: Enter how much Pension Credit you receive
cy: Nodwch faint o Gredyd Pensiwn rydych chi'n ei gael

source: Tell us if paying a fine would cause you serious financial problems
cy: Dywedwch wrthym a fyddai talu dirwy yn achosi problemau ariannol difrifol i chi

source: You must confirm that you have read and understand the important information
cy: Rhaid i chi gadarnhau eich bod wedi darllen a deall yr wybodaeth bwysig

source: Tell us how you earn your money
cy: Dywedwch wrthym sut yr ydych yn ennill eich arian

source: You must tell us why you think you should be allowed to pay your fine in instalments
cy: Mae'n rhaid i chi ddweud wrthym pam rydych chi'n credu y dylech gael caniatâd i dalu eich dirwy mewn rhandaliadau

source: You must tell us if anyone else contributes to your household bills
cy: Rhaid i chi ddweud wrthym os yw unrhyw un arall yn cyfrannu at dalu biliau eich cartref

source: Accommodation is a required field
cy: Rhaid i chi nodi eich costau llety

source: Accommodation must be a number
cy: Rhaid i’r costau llety fod yn rhif

source: Accommodation must be a number greater than, or equal to, 0
cy: Rhaid i’r costau llety fod yn fwy na, neu’n hafal i, 0

source: Utility bills is a required field
cy: Rhaid i chi nodi costau eich biliau cyfleustodau

source: Utility bills must be a number
cy: Rhaid i’r costau biliau cyfleustodau fod yn rhif

source: Utility bills must be a number greater than, or equal to, 0
cy: Rhaid i’r costau biliau cyfleustodau fod yn rhif mwy na, neu’n hafal i, 0

source: Insurance is a required field
cy: Rhaid i chi nodi eich costau yswiriant

source: Insurance must be a number
cy: Rhaid i’r costau yswiriant fod yn rhif

source: Insurance must be a number greater than, or equal to, 0
cy: Rhaid i’r costau yswiriant fod yn rhif mwy na, neu’n hafal i, 0

source: Council tax is a required field
cy: Rhaid i chi nodi swm y dreth gyngor yr ydych yn ei thalu

source: Council tax must be a number
cy: Rhaid i’r dreth gyngor fod yn rhif

source: Council tax must be a number greater than, or equal to, 0
cy: Rhaid i’r dreth gyngor fod yn rhif mwy na, neu’n hafal i, 0

source: TV subscription is a required field
cy: Rhaid i chi nodi costau unrhyw danysgrifiad teledu

source: TV subscription must be a number
cy: Rhaid i’r tanysgrifiad teledu fod yn rhif

source: TV subscription must be a number greater than, or equal to, 0
cy: Rhaid i’r costau tanysgrifiad teledu fod yn rhif mwy na, neu’n hafal i, 0

source: Travel expenses is a required field
cy: Rhaid i chi nodi eich costau teithio

source: Travel expenses must be a number
cy: Rhaid i’r costau teithio fod yn rhif

source: Travel expenses must be a number greater than, or equal to, 0
cy: Rhaid i’r costau teithio fod yn rhif mwy na, neu’n hafal i, 0

source: Telephone is a required field
cy: Rhaid i chi nodi rhif ffôn symudol neu rif ffôn llinell dir

source: Telephone must be a number
cy: Rhaid i’r rhif ffôn fod yn rhif

source: Telephone must be a number greater than, or equal to, 0
cy: Rhaid i’r rhif ffôn fod yn rhif mwy na, neu’n hafal i, 0

source: Loan repayment is a required field
cy: Rhaid i chi nodi unrhyw ad-daliadau benthyciadau

source: Loan repayment must be a number
cy: Rhaid i'r ad-daliadau benthyciadau fod yn rhif

source: Loan repayment must be a number greater than, or equal to, 0
cy: Rhaid i’r ad-daliadau benthyciadau fod yn rhif mwy na, neu’n hafal i, 0

source: Court payments is a required field
cy: Rhaid i chi nodi unrhyw daliadau i’r llys

source: Court payments must be a number
cy: Rhaid i’r taliadau llys fod yn rhif

source: Court payments must be a number greater than, or equal to, 0
cy: Rhaid i’r taliadau llys fod yn rhif mwy na, neu’n hafal i, 0

source: Child maintenance is a required field
cy: Rhaid i chi nodi unrhyw gostau cynhaliaeth plant

source: Child maintenance must be a number
cy: Rhaid i’r gynhaliaeth plant fod yn rhif

source: Child maintenance must be a number greater than, or equal to, 0
cy: Rhaid i’r gynhaliaeth plant fod yn rhif mwy na, neu’n hafal i, 0

source: Tell us if you have any other significant expenses
cy: Dywedwch wrthym os oes gennych unrhyw dreuliau sylweddol eraill

source: Enter your other significant expenses
cy: Rhowch fanylion eich treuliau sylweddol eraill

source: Enter the monthly total of your other significant expenses
cy: Rhowch gyfanswm misol eich treuliau sylweddol eraill

source: The monthly total must be a number
cy: Rhaid i’r cyfanswm misol fod yn rhif

source: The monthly total must be a number greater than, or equal to, 0
cy: Rhaid i’r cyfanswm misol fod yn rhif mwy na, neu’n hafal i, 0

source: You must tell us if the company has been trading for more than 12 months
cy: Rhaid i chi ddweud wrthym os yw’r cwmni wedi bod yn masnachu am fwy na 12 mis

source: Enter the number of employees
cy: Rhowch y nifer o gyflogeion

source: Enter the company's gross turnover
cy: Rhowch drosiant gros y cwmni

source: Enter the company's net turnover
cy: Rhowch drosiant net y cwmni

source: Enter the company's projected gross turnover
cy: Rhowch drosiant gros amcanol y cwmni

source: Enter the company's projected net turnover
cy: Rhowch drosiant net amcanol y cwmni

source: Tell us if you want to receive an email confirming your plea submission
cy: Dywedwch wrthym os ydych eisiau cadarnhad drwy e-bost eich bod wedi cyflwyno eich ple

source: You must provide an email address if you want to receive email updates about this case
cy: Mae'n rhaid i chi roi cyfeiriad e-bost os ydych eisiau cael gwybod y diweddaraf am yr achos hwn drwy e-bost

source: Enter your postcode
cy: Rhowch eich cod post

source: What is your Unique Reference Number (URN)?
cy: Beth yw eich Cyfeirnod unigryw (URN)?

source: On page 1 of the notice, usually at the top.
cy: Ar dudalen 1 yr hysbysiad, fel arfer ar y brig.

source: Number of charges
cy: Nifer y cyhuddiadau

source: How many offences are listed on your notice?
cy: Faint o droseddau sy'n cael eu rhestru ar eich hysbysiad?

source: Postcode
cy: Cod post

source: As written on the notice we sent you
cy: Fel y mae wedi'i ysgrifennu ar yr hysbysiad a anfonwyd atoch

source: Date of birth
cy: Dyddiad geni

source: Single Justice Procedure Notice
cy: Hysbysiad Gweithdrefn Un Ynad

source: Something else
cy: Rhywbeth arall

source: What is the title at the very top of the page?
cy: Beth yw'r teitl ar frig y dudalen?

source: The person named in the notice
cy: Yr unigolyn sydd wedi'i enwi yn yr hysbysiad

source: Pleading on behalf of a company
cy: Unigolyn yn pledio ar ran cwmni

source: Are you? (plea made by)
cy: Pwy ydych chi?

source: Choose one of the following options:
cy: Dewiswch un o'r opsiynau canlynol:

source: Court hearing date
cy: Dyddiad y gwrandawiad llys

source: On page 1 of the notice, near the top. <br>For example, 30/07/2014
cy: Ar dudalen 1 yr hysbysiad, yn agos i'r brig. <br>Er enghraifft, 30/07/2014

source: Posting date
cy: Dyddiad postio

source: First name
cy: Enw cyntaf

source: Last name
cy: Cyfenw

source: Is your address correct on page 1 of the notice we sent to you?
cy: A yw eich cyfeiriad yn gywir ar dudalen 1 yr hysbysiad a anfonwyd atoch?

source: If no, tell us your correct address here:
cy: Os nad yw, dywedwch wrthym yma beth yw eich cyfeiriad cywir:

source: Contact number
cy: Rhif Cyswllt

source: Landline or mobile number.
cy: Rhif llinell dir neu rif ffôn symudol.

source: Do you have a National Insurance number?
cy: A oes gennych chi rif Yswiriant Gwladol?

source: If yes, enter it here. It can be found on your National Insurance card, benefit letter, payslip or P60 - for example, 'QQ 12 34 56 C'
cy: Os oes, nodwch y rhif yma. Gallwch ddod o hyd i'r rhif ar eich cerdyn Yswiriant Gwladol, llythyr budd-dal, slip cyflog neu P60 - er enghraifft, 'QQ 12 34 56 C'

source: Do you have a UK driving licence?
cy: A oes gennych chi drwydded yrru y DU?

source: Entering your UK driving licence number means you don't have to send your licence to the court.
cy: Mae rhoi eich rhif trwydded yrru y DU yn golygu nad oes rhaid i chi anfon eich trwydded i'r llys.

source: If yes, enter it here. Your driving licence number is in section 5 of your driving licence photocard.
cy: Os oes, nodwch y rhif yma. Mae rhif eich trwydded yrru yn adran 5 o'ch trwydded yrru cerdyn llun.

source: director
cy: cyfarwyddwr

source: company secretary
cy: ysgrifennydd y cwmni

source: company solicitor
cy: cyfreithiwr y cwmni

source: Company name
cy: Enw’r cwmni

source: As written on page 1 of the notice we sent you.
cy: Fel y mae wedi'i ysgrifennu ar dudalen 1 yr hysbysiad a anfonwyd atoch.

source: Is the company's address correct on page 1 of the notice we sent to you?
cy: A yw cyfeiriad y cwmni'n gywir ar dudalen 1 yr hysbysiad a anfonwyd atoch?

source: If no, tell us the correct company address here:
cy: Os nad yw, dywedwch wrthym yma beth yw cyfeiriad cywir y cwmni:

source: Your first name
cy: Eich enw cyntaf

source: Your last name
cy: Eich cyfenw

source: Your position in the company
cy: Eich swydd yn y cwmni

source: Office or mobile number.
cy: Rhif ffôn swyddfa neu rif ffôn symudol.

source: Employed
cy: Gyflogedig

source: Employed and also receiving benefits
cy: Yn gyflogedig a hefyd yn cael budd-daliadau

source: Self-employed
cy: Hunangyflogedig

source: Self-employed and also receiving benefits
cy: Hunangyflogedig a hefyd yn cael budd-daliadau

source: Receiving out of work benefits
cy: Derbyn budd-daliadau diweithdra

source: Other
cy: Arall

source: Are you? (employment status)
cy: Ydych chi’n?

source: Weekly
cy: Wythnosol

source: Fortnightly
cy: Pob pythefnos

source: Monthly
cy: Fisol

source: How often do you get paid from your employer?
cy: Pa mor aml rydych chi'n cael eich talu gan eich cyflogwr?

source: What is your take home pay (after tax)?
cy: Beth yw eich cyflog clir (ar ôl treth)?

source: How often do you get paid?
cy: Pa mor aml rydych chi’n cael eich talu?

source: Contributory Jobseeker's Allowance
cy: Lwfans Ceisio Gwaith Cyfrannol

source: Income-based Jobseekers Allowance
cy: Lwfans Ceisio Gwaith yn seiliedig ar Incwm

source: Universal Credit
cy: Credyd Cynhwysol

source: Which out of work benefit do you receive?
cy: Pa fudd-dal diweithdra rydych chi'n ei gael?

source: How often is your benefit paid?
cy: Pa mor aml y telir eich budd-dal i chi?

source: How much is your benefit payment?
cy: Faint yw eich taliad budd-dal?

source: What is the source of your main income?
cy: Beth yw ffynhonnell eich prif incwm?

source: For example, student loan, pension or investments.
cy: Er enghraifft, benthyciad i fyfyrwyr, pensiwn neu fuddsoddiadau

source: How often is your main income paid?
cy: Pa mor aml y telir eich prif incwm i chi?

source: How much is your take home income (after tax)?
cy: Faint yw eich incwm clir (ar ôl treth)?

source: Do you receive Pension Credit?
cy: Ydych chi'n cael Credyd Pensiwn?

source: Contributory Employment and Support Allowance
cy: Lwfans Cyflogaeth a Chymorth Cyfrannol

source: Income-related Employment and Support Allowance
cy: Lwfans Cyflogaeth a Chymorth yn Seiliedig ar Incwm

source: Income Support
cy: Cymhorthdal Incwm

source: Which benefit do you receive?
cy: Pa fudd-dal rydych chi'n ei gael?

source: How often is your Pension Credit paid?
cy: Pa mor aml y telir eich Credyd Pensiwn i chi?

source: How much is your Pension Credit payment?
cy: Faint yw eich taliad Credyd Pensiwn?

source: Would paying a fine cause you serious financial problems?
cy: A fyddai talu dirwy yn achosi problemau ariannol difrifol i chi?

source: For example, you would become homeless.
cy: Er enghraifft, byddech yn dod yn ddi-gartref.

source: How would paying a fine cause you serious financial problems?
cy: Sut fyddai talu dirwy yn achosi problemau ariannol difrifol i chi?

source: Why you think the court should allow you to pay your fine in instalments:
cy: Pam rydych chi'n credu y dylai'r llys roi caniatâd i dalu eich dirwy mewn rhandaliadau:

source: Accommodation
cy: Llety

source: Rent, mortgage or lodgings
cy: Rhent, morgais neu lety

source: Utility bills
cy: Biliau Cyfleustodau

source: Gas, water, electricity etc
cy: Nwy, dŵr, trydan ac ati

source: Insurance
cy: Yswiriant

source: Home, life insurance etc
cy: Yswiriant cartref, bywyd ac ati

source: Council tax
cy: Y Dreth Gyngor

source: Does anyone else contribute to these bills?
cy: A oes unrhyw un arall yn cyfrannu at dalu’r biliau hyn?

source: Television subscription
cy: Tanysgrifiad teledu

source: TV licence, satellite etc
cy: Trwydded teledu, lloeren ac ati

source: Travel expenses
cy: Costau teithio

source: Fuel, car, public transport etc
cy: Tanwydd, car, trafnidiaeth gyhoeddus ac ati

source: Telephone
cy: Rhif ffôn

source: Landline and/or mobile
cy: Llinell dir a/neu ffôn symudol

source: Loan repayments
cy: Ad-daliadau Benthyciadau

source: Credit card, bank etc
cy: Cerdyn credyd, banc ac ati

source: County court orders
cy: Gorchmynion llys sirol

source: Child maintenance
cy: Cynhaliaeth Plant

source: Any other expenses that are not listed above?
cy: Unrhyw dreuliau eraill nad ydynt wedi'u rhestru uchod?

source: Other significant expenses you think the court should know about. For example, childcare
cy: Unrhyw dreuliau sylweddol y credwch dylai'r llys wybod amdanynt. Er enghraifft, gofal plant

source: If yes, tell us here
cy: Os oes, dywedwch wrthym yma

source: Monthly total of your other significant expenses
cy: Cyfanswm misol eich treuliau sylweddol eraill

source: Has the company been trading for more than 12 months?
cy: A yw’r cwmni wedi bod yn masnachu am fwy na 12 mis?

source: Number of employees
cy: Nifer o gyflogeion

source: Gross turnover
cy: Trosiant gros

source: For example, 150000
cy: Er enghraifft, 150000

source: Net turnover
cy: Trosiant net

source: For example, 110000
cy: Er enghraifft, 110000

source: Do you want to receive an email confirming your plea has been sent to the court?
cy: Ydych chi eisiau cadarnhad drwy e-bost bod eich ple wedi cael ei anfon i'r llys?

source: If yes, enter your email address here:
cy: Os oes, rhowch eich cyfeiriad e-bost yma:

source: Mitigation
cy: Lliniariad
